Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: རྩྭ་དང་། རྩ་བ་དང་། ལོ་མ་དང་། འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་ཀྱི་ནང་དུ་སྩལ་ཏོ། །དེ་ན་སེམས་ཅན་གང་དག་གིས་ཡང་དག་པར་སྦྱར་ཏེ།
en: There I will also take up the vast essence of the earth , seeking among the various grasses, roots, leaves, petals, flowers, and fruits to heal the diseases of beings and be of use to them.

source: འཚལ་ནས་སེམས་ཅན་དེ་དག་སེམས་དང་སེམས་ལས་བྱུང་བ་དག་ལ་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་སོ་སོར་རྟོག་པར་གང་འཇུག་པ་དེ་ཡང་བདག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་འགྱུར་བ་དང་། ཇི་ལྟར་བདག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སྐྱེས་པའི་མཐུ་ཆེན་པོ་བགྱིད་པ་དེ་བཞིན་དུ།
en: Then, whenever a person who has prepared these medicines comes to understand that the mind and all mental states are impermanent, suffering, empty, and selfless, may this be the cause for my completing the perfection of insight.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི། འཇིག་རྟེན་གྱི་ཁམས་རེ་རེར་ཡང་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ། བདག་གིས་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་སྤྲོ་བ་ཆེན་པོ་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། རྟུལ་བ་འདི་ལྟ་བུ་དང་། སེམས་ཅན་ནད་པ་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་འདི་ལྟ་བུས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །ཅེས་སྨོན་ལམ་བཏབ་བོ།
en: To the degree that I manifest this great power in this buddha field, may I, in a female form, ripen and serve diseased beings in worlds throughout the ten directions as numerous as the grains of sand in the Gaṅgā, for as many eons as there are grains of sand in the Gaṅgā, with great enthusiasm, strength, diligence, and gentleness. Through this may I awaken fully and completely to unsurpassed and perfect buddhahood.’

source: །ད་ལྟར་ཡང་བདག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱན་སྔར་སྨོན་ལམ་འཕེལ་བར་བགྱིད་དོ།
en: “Even now, I strengthen my aspiration before the blessed buddhas.

source: །སྐལ་བ་ཆེན་པོ་དང་ལྡན་པ། ཕ་རོལ་གནོན་པ།
en: May I be the assistant of the greatly fortunate, victorious, and reliable Flower Mendicant.

source: བརྟན་པ་དགེ་སྦྱོང་མེ་ཏོག་འདིའི་གྲོགས་སུ་ཡང་གྱུར་ཅིག །བདག་ཅག་གཉིས་ཀས་ཁ་དོག་གཅིག་ཏུ་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིའོ།
en: We will both bring beings to maturity while in the guise of female forms bearing the same complexion.

source: །བུད་མེད་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིའོ།
en: We will ripen women.

source: །བཅོམ་ལྡན་འདས་ཡང་བདག་ཅག་གཉིས་ཀྱིས་ནད་པ་རྣམས་དང་། རྒན་པོ་རྣམས་ཀྱི་ནད་རབ་ཏུ་ཞི་བར་བགྱི་བའི་སླད་དུ། སའི་བཅུད་ལས་བྱིན་བླངས་ལ་ཟས་དང་། སྐོམ་དང་། ཁ་དོག་དང་། དྲི་དང་། རོ་དང་ལྡན་པ་སྦྱར་བར་བགྱི་སྟེ།
en: Blessed ones, furthermore, for the sake of healing the diseases of the old and sick, the two of us will prepare food and drink replete with color, scent, and taste extracted from the essence of the earth

source: བདག་གི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དུ་ཡོངས་སུ་རྫོགས་པའི་རྒྱུར་གྱུར་ཅིག །བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞེ་ན།
en: In doing so, may that become a cause for us to complete all the perfections up to insight. “So, when I ask whether I will fully awaken to unsurpassed and perfect buddhahood, I implore you blessed buddhas to give your assent.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བདག་ལ་ལེགས་སོ། །ཞེས་བགྱི་བ་སྩལ་དུ་གསོལ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ་དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས།
en: Blessed buddhas, please bestow a prophecy of unsurpassed and perfect awakening upon me.”

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ལེགས་སོ་ལེགས་སོ་ཞེས་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནོ།
en: The blessed buddhas then said, “Good, good, O sublime being.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Śākyamuni then declared:

source: །ཁྱེད་ནི་འཇིག་རྟེན་ནད་པའི་སྨན་པ་གཅིག །དེ་བཞིན་དབང་པོ་རྣམས་ལ་བདེ་བྱེད་པ།
en: “You are the sole doctor for the ailing world Who, further, delights all lords.

source: པད་མ་ལྡན་པ་ཞིང་གཙང་དམ་པ་དེར།
en: In the sublime and pure field called Lotus

source: །རྣམ་པར་སྣང་མཛད་ཅེས་བྱའི་རྒྱལ་བར་འགྱུར།
en: You will become the victor Vairocana

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་འཛིན་ཅེས་བྱ་བ།
en: The bodhisattva great being Earth Holder also desired a prophecy.

source: ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས། བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་ས་ལ་ཡོངས་སུ་སྤྱོད་པས་སྨོན་ལམ་བཏབ་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་དེ་ལ་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: In a female form, he made the aspiration to be able to bring beings to maturity by employing earth and the thus-gone Śākyamuni said to him:

source: །ཁྱོད་ནི་རི་དང་ས་འཛིན་གཅིག་པུ་སྟེ།
en: “You are the sole supporter of the mountains and earth

source: །ཁྱོད་ཀྱི་རེ་བ་མྱུར་དུ་རྫོགས་པར་འགྱུར།
en: May your hopes be quickly fulfilled.

source: །རྒྱལ་ལྡན་ཞིང་མཆོག་ཕུན་སུམ་ཚོགས་པར་ནི།
en: In the rich and supreme field Victorious

source: །ཡེ་ཤེས་དབང་ཕྱུག་ཅེས་བྱའི་རྒྱལ་བར་འགྱུར།
en: You will become the victor Lord of Wisdom.”

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་བླ་མ་ཞེས་བྱ་བ།
en: Likewise, the bodhisattva Supreme Wisdom also desired a prophecy.

source: ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས། བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་ཆུ་ལ་ཡོངས་སུ་སྤྱོད་པས། སྨོན་ལམ་བཏབ་པ་དང་། དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Taking a female form, he made the aspiration to be able to bring beings to maturity by employing water and the Blessed One said to him as well:

source: །ཁྱོད་ཀྱིས་འདིར་ནི་ཐབས་དང་ཤེས་རབ་ཀྱིས། །མེ་ཏོག་འབྲས་བུས་སེམས་ཅན་ཚིམ་བྱས་ནས།
en: “You have satisfied beings here with fruits and flowers Through your skill and insight.

source: །ཞིང་མཆོག་རྣམ་པར་དག་པ་སྒོ་ལྡན་དུ།
en: In the supreme and pure field Doorway

source: །ཉི་མ་མཆོག་གི་བདེ་བར་གཤེགས་པར་འགྱུར།
en: You will become the victor Supreme Sun of Bliss.”

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐལ་བ་སྟོན་ཞེས་བྱ་བ། ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: Likewise, the bodhisattva Demonstrator of Consequences also desired a prophecy.

source: བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་མེ་ལ་ཡོངས་སུ་སྤྱོད་པས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར།
en: Taking a female form, he made the aspiration to be able to bring beings to maturity by employing fire.

source: སྨོན་ལམ་བཏབ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One said to him as well:

source: །འགྲོ་བ་མི་རྟག་འདུ་ཤེས་བྱས་ནས་ནི།
en: “Perceiving beings as impermanent,

source: །སྐྱེ་བོ་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་བྱས་ནས།
en: You matured beings to reach awakening.

source: །སྐྱེ་བོ་རྡུལ་ཅན་ཞིང་མཆོག་རབ་བསྔགས་པར།
en: O disciplined being, in the supreme field Highly Extolled

source: །མེ་ཡི་སྒྲོན་མ་བདེ་བར་གཤེགས་པར་འགྱུར།
en: You will become the blissful one Lamp of Fire.”

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་རྣམས་ལ་གཡོ་ཞིང་། རྡུལ་དང་བྲལ་བ་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: Likewise, the bodhisattva Immaculately Moved by Beings also desired a prophecy.

source: བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་རླུང་ལ་ཡོངས་སུ་སྤྱོད་པས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར།
en: Taking a female form, he made the aspiration to be able to bring beings to maturity by employing wind.

source: །གཡོ་བས་སེམས་ཅན་རྣམས་ལ་དགའ་སྦྱར་ཏེ།
en: “In movement, you will bring bliss to beings,

source: །ཁྱོད་ནི་ཉོན་མོངས་རབ་ཏུ་ཞི་བྱེད་ཅིང་།
en: Totally pacifying their afflictions.

source: །རྣམ་དག་ཞིང་དུ་མཉམ་ཉིད་དོན་མཐོང་བ།
en: In the field of Purity you will see the meaning of sameness

source: །ཟླ་བའི་འོད་ཅེས་བྱ་བའི་རྒྱལ་བར་འགྱུར།
en: And become the victor Candraprabha.”

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་པའི་སྒྲོན་མ་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: Likewise, the bodhisattva Unobscured Lamp also desired a prophecy.

source: བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་ནམ་མཁའ་ལ་ཡོངས་སུ་སྤྱོད་པས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། སྨོན་ལམ་བཏབ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་དེ་ལ་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Taking a female form, he made the aspiration to be able to bring beings to maturity by employing space. The Blessed One said to him as well:

source: །མི་གནས་ཡེ་ཤེས་སྟོན་པ་མྱ་ངན་མེད།
en: “Teacher of nonabiding wisdom, beyond anguish;

source: །ཡང་དག་བྱང་ཆུབ་ལམ་མཆོག་དོན་སྨྲ་བ།
en: Preacher of what is meaningful—the supreme and authentic path of awakening—

source: །སྒྲིབ་པ་བསལ་ཅིང་ཆགས་པ་མེད་ཞིང་དུ།
en: In the field called Unimpeded Remover of Obscurations

source: །ཡེ་ཤེས་མཆོག་ཅེས་བྱ་བའི་རྒྱལ་བར་འགྱུར།
en: You will become the victor Supreme Wisdom

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་མཆོག་སྨྲ་བ་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: Likewise, the bodhisattva Supreme Scent-Perfused Preacher also desired a prophecy.

source: བུད་མེད་ཀྱི་གཟུགས་དང་ལྡན་པ་མེ་ཏོག་ལ་ཡོངས་སུ་སྤྱོད་པས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར།
en: Taking a female form, he made the aspiration to be able to bring beings to maturity by employing flowers.

source: །སངས་རྒྱས་ལམ་མཆོག་སྟོན་པ་རྣམས་ལ་ནི། །མེ་ཏོག་སྤོས་མཆོག་དག་གིས་མཆོད་བྱས་ནས།
en: The buddhas who teach the supreme path,

source: །མེ་ཏོག་འབྱུང་གནས་ཞིང་མཆོག་རྣམ་དག་ཏུ།
en: In the supreme field Source of Flowers

source: །ཀུན་ནས་སྤོས་ཀྱི་བདེ་བར་གཤེགས་པར་འགྱུར།
en: You will become the blissful one Totally Fragrant.”

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཁ་དོག་ངུར་སྨྲིག་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: Likewise, the bodhisattva Saffron Color also desired a prophecy.

source: བུད་མེད་ཀྱི་གཟུགས་དང་ལྡན་པས་ཚོན་སྣ་ཚོགས་ལ་ཡོངས་སུ་སྤྱོད་པས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར།
en: Taking a female form, he made the aspiration to be able to bring beings to maturity by employing various colors.

source: །འཇིག་རྟེན་ངུར་སྨྲིག་གོས་ལ་བཙུད་ནས་སུ།
en: “Dressing the world in saffron,

source: །དཀོན་མཆོག་གསུམ་རིགས་དགའ་བར་ལྡན་བྱས་ནས།
en: You fashion it to the delight of the lineage of the Three Jewels.

source: །སྔོན་པོར་སྣང་བའི་སངས་རྒྱས་ཞིང་མཆོག་ཏུ།
en: In the supreme buddha field Blue Light

source: །རིན་ཆེན་སྣང་བའི་བདེ་བར་གཤེགས་པར་འགྱུར།
en: You will become blissful one Precious Light.”

source: །དེ་བཞིན་དུ་ས་བོན་དང་། ནགས་ཚལ་དང་། འབྲས་བུའི་ལྷ་དུ་མ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བདུན་གྱི་བར་དག་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: Likewise, various gods of seeds, forests, fruits, and so forth, all the way up to sixty-seven trillion bodhisattvas, also desired to receive prophecies.

source: བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བུད་མེད་ཤིན་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ་དང་། དེ་དག་ཚིགས་སུ་བཅད་པ་རེ་རེས་ལུང་བསྟན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: All of them made aspiration prayers to reach unsurpassed and perfect awakening in order to bring beings to maturity while in female form and to be able to ripen women.

source: ཕོ་མཚན་གྱུར་ཏེ་མོ་མཚན་ཐོབ་པ་ནི་ཤིན་ཏུ་རྙེད་པར་སླ་ལ། མོ་མཚན་གྱུར་ཏེ་ཕོ་མཚན་ཐོབ་པ་ནི་ཤིན་ཏུ་རྙེད་པར་དཀའ་བའི་ཕྱིར་རོ།
en: It is because it is very easy for someone who has male genitalia to acquire female genitalia, whereas it is very difficult for someone who has female genitalia to acquire male genitalia. They each individually received a verse of prophecy.

source: །དེའི་ཚེ་ན་ལྷ་དང་ཀླུ་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་ནས།
en: At that time, billions of gods and great nāgas also desired prophecies.

source: བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ་དང་། ཚིགས་སུ་བཅད་པ་རེ་རེས་སོ་སོར་ལུང་བསྟན་པ་ཐོབ་བོ།
en: They aspired to awakening, and each individually received a verse of prophecy.

source: །དེ་བཞིན་དུ་ལྷ་མ་ཡིན་དཀྲིགས་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་དང་། བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དང་། ལྷ་དང་མིའི་བུ་མོ་མི་འཁྲུགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བདུན་ཅུ་དང་། བདུད་དང་བདུད་ཀྱི་འཁོར་དཀྲིགས་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ནས། མི་དང་མི་མ་ཡིན་པའི་བར་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བར་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་པར་འདོད་པ་དང་། ཚིགས་སུ་བཅད་པ་རེ་རེས་སོ་སོར་ལུང་བསྟན་པ་ཐོབ་བོ།
en: Likewise, sixty-four quintillion eight hundred million asuras, seventy septillion female gods and humans, and ninety-nine novillion māras and their retinues, as well as humans and nonhumans including brahmins, kṣatriyas, vaiśyas, śūdras, men, women, boys, and girls, all as numerous as the grains of sand in the Gaṅgā, desired to receive a prophecy of unsurpassed and perfect awakening. They each individually received a verse of prophecy.

source: །མི་དང་། མི་མ་ཡིན་པ་དང་། དེ་བཞིན་དུ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་བགྲང་བ་ལས་འདས་པ་སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པ་དག་ནི་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: Moreover, a countless infinitude of humans and nonhumans, and likewise gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, pretas, and piśācas that had not previously generated the mind directed toward unsurpassed and perfect awakening, developed it.

source: །སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་གྱུར་ཏོ།
en: Countless beings came to abide at the stage of irreversibility.

source: །སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ནི། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་སྣ་ཚོགས་ཐོབ་པར་གྱུར་ཏོ།
en: Countless beings achieved the various absorptions, acceptances, and dhāraṇīs of bodhisattvas.

source: །སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ནི་འབྲས་བུ་ཐོབ་ནས། འདོད་ཆགས་དང་བྲལ་ཏེ་ཟག་པ་ཟད་པར་གྱུར་ཏོ།
en: Countless beings achieved the result, were freed from desire, and exhausted their defilements.

source: །སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལས་སེམས་བསྐྱེད་ནས། སངས་རྒྱས་ཉིད་དུ་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་གྱུར་ཏེ།
en: Countless beings aroused their minds away from the vehicles of the hearers and solitary buddhas and came to abide on the stage of irreversibility within buddhahood itself.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་ཐམས་ཅད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བཀའ་སྩལ་པ་བཞིན་དུ་དམ་པའི་ཆོས་འདི་ཡོངས་སུ་གཟུང་བར་བགྱིའོ།
en: All of these beings then declared with one voice, “We all will uphold this sacred Dharma just as the blessed buddhas have commanded.

source: །གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། ཡི་གེར་འདྲི་བ་ནས། འཆང་བར་བགྱིད་པའི་བར་གྱིས་གང་ཟག་དེ་དག་ཀྱང་། རིག་པས་ཡོངས་སུ་བསྐྱང་བར་བགྱིའོ།
en: Whoever retains this Dharma teaching, commits it to writing, or upholds it, we shall use our skills to sustain that person.”

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། ལུང་བསྟན་པའི་ལེའུ་སྟེ། བརྒྱད་པའོ།།
en: This concludes the chapter on prophecy, the eighth in the “ Ratnaketu ” section of the Great Collection.

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཡང་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཐུགས་བརྩེ་བས་དྲི་བའི་སླད་དུ།
en: The blessed, thus-gone Śākyamuni then said, “O all you blessed buddhas who have come here to this buddha field motivated by compassion to engage in discussion, please give these beings your attention.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཤེགས་པ་ཐམས་ཅད་རིགས་ཀྱི་བུ་འདི་དག་གིས་གོས་དང་། ཟས་དང་། སྐོམ་དང་། སྨན་དང་། ཡོ་བྱད་ཀྱིས་སེམས་ཅན་རྣམས་ཤིན་ཏུ་ཚིམ་པར་བགྱིས་ཏེ།
en: These noble children will satisfy others with clothing, food, drink, medicine, and supplies.

source: བུད་མེད་ཀྱི་གཟུགས་ཀྱིས་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། ཅི་ནས་འདི་དག་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ།
en: They will use the female form to mature others for unsurpassed and perfect awakening.

source: སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཅི་འཚལ་བ་དང་། གང་གི་སླད་དུ་འཚལ་བ་དང་། ཇི་ལྟ་བུ་འཚལ་བའི་གོས་དང་། ཟས་དང་། སྐོམ་དང་། སྨན་དང་། ཡོ་བྱད་རྣམས་སྤྲུལ་པའམ།
en: From the moment they developed the mind of awakening in order to mature others, they have been dedicated to emanating and providing clothing, food, drink, medicine, and supplies to fulfill their hopes—no matter what, why, or how these things are desired.

source: བཤམ་པ་འབྱོར་བར་འགྱུར་བའི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། ཅི་ནས་སྐྱེས་བུ་དམ་པ་འདི་དག །སྐྱེས་བུ་ཆེན་པོའི་མཐུ་འདི་ལྟ་བུ་བགྱིད་པ་དང་། སེམས་ཅན་རྣམས་ལ་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པས་རིམ་གྲོ་བགྱིད་ནུས་པར་འདི་དག་ལ་དགོངས་སུ་གསོལ།
en: These sublime beings will enact this great power and be able to serve beings with what is enjoyable and useful.”

source: དེ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས། ཐུགས་རྗེ་ཆེན་པོ་དང་། བསོད་ནམས་དང་། ཡེ་ཤེས་དང་། བསམ་གཏན་གྱིས་བརྒྱན་པའི་རྒྱུ་འཐུན་པ་ཡིད་ལ་མཛད་པས། སྐྱེས་བུ་དམ་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཁྱེད་ཀྱི་བསམ་པ་དང་། ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་རྒྱུ་འཐུན་པའི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྦྱིན་ནོ། །འདི་ལྟ་སྟེ། ཛྱོ་ཏོ་བ་བ། དྷྲི་ཏི་བ་བ། མུ་ནི་བ་བ། ས་ཏྱ་བ་བ། སཱུ་ནྱ། ཨ་ལང་ཀ་ར་བ་བ། དྷྱ་ན་ར་ས་བ་བ། མ་ཧ་ཀཱ་རུ་ཎ་བ་བ། མ་ཧཱ་པྲ་ཏི་བ་བ། ཨ་མོ་ཧ་བ་བ། རུ་ཏི་བ་བ། ཀྵི་ཏི་བ་བ། ས་ལི་ལ་བ་བ། ཁ་ག་བ་བ། བ་ཡུ་བ་བ། བརྟ་བ་བ། ཨ་དྷིཥྛཱ་ན་བ་བ། ཨ་མ་བ་བ། ཨ་ཧ་ན་ན་བ་བ། ཏ་ཐཱ་བ་བ། བྷཱུ་ཏ་ཀོ་ཊི་བ་བ། ནི་ར་བྲི་ཏི་བ་བ། ཏྲི་ཡ་ལན་བ་བ། ཏྲཻ་དྷཱ་ཏུ་ཀ་བ།
en: Thereupon, bringing to mind the concordant cause that is adorned by great compassion, merit, wisdom, and absorption, the blessed buddhas addressed these sublime beings, saying, “In order to fulfill your wishes and hopes, the blessed buddhas who course through the three times will grant you their blessings and bestow this mantra, which accords with the cause of all roots of virtue.

source: ཏྲི་བི་མོ་ཀྵ་བ་བ། ཏྲི་ཤཱུ་ཀླ་བ་བ། རཥྚི་ཨ་དྷིཥྛཱ་ན་བ་བ། བ་བ་བ་བ་བ། ས་མ་ཏྲ་ཡན་ནྱ་ས་མ་ཏཱ། ཊ་ཊ་ཊ་ཊ།
en: jyotovava dhriti­vava muni­vava satya­vava sūnya alaṅkara­vava dhyāna­rasa­vava mahā­kāruṇa­vava mahā­prativava amohavava ruti­vava kṣitiv­ava salila­vava khaga­vava baya­vava varta­vava adhiṣṭhāna­vava amavava ahannavava tathāvava bhūta­koṭi­vava nirvriti­vava triyalana­vava traidhātu­kava tri­vimokṣa­vava tri­śūkla­vava raṣṭi adhiṣṭhāna­vava vava vava vava samatrayananyasamatā ṭaṭa ṭaṭa ṭaṭa ṭaṣṭa siddhi­sarva­kula­śala­mula adhiṣṭhānaya svāhā!

source: ཊ་ཊ་ཊ་ཥྚ། སིད་དྷི་སརྦ་ཀུན་ལ་ཤ་ལ་མུ་ལ། ཨ་དྷིཥྛ་ན་ཡ་སྭཱ་ཧཱ། སྐྱེས་བུ་དམ་པ་ཁྱེད་ཀྱིས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི། གསང་སྔགས་ཀྱི་ཚིག་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་འདི་དག །སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཁྱེད་ཀྱི་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཟུང་ཤིག །ཡང་དེའི་ཚེ།
en: “Sublime beings, you should take up this mantra of the sameness of all phenomena, which fulfills all wishes, in order to accomplish the enjoyment, delight, and ripening of beings and the mastery of your awakened conduct.”

source: དགེ་སྦྱོང་མེ་ཏོག་དང་། དཔལ་གྱི་ལྷ་མོ་དང་། རྩིའི་ལྷ་མོ་གྲུབ་པའི་བློ་གྲོས་དང་། ལྷ་མོ་ས་འཛིན་ལ་སོགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཐམས་ཅད་བུད་མེད་ཀྱི་གཟུགས་ཀྱིས། སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཀུན་སྤྱོད་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ནས།
en: At that time, ten thousand bodhisattvas, including Flower Mendicant, Goddess of Glory, the medicine goddess Siddhimati, and the goddess Earth Holder, exerted themselves in female form to accomplish the enjoyment, delight, and ripening of beings.

source: དེ་དག་ཐམས་ཅད་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་ཅག་གི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འདི་རྣམས་ཀྱིས། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གསུངས་པས་ན། བྱིན་གྱི་རླབས་འདིས་བདག་ཅག་སེམས་ཅན་ཐམས་ཅད་ལ་རིམ་གྲོ་བགྱིད་ནུས་སོ།
en: They said together with one voice, “Since this mantra has been spoken by the blessed buddhas in order to fulfill our hopes, we will be able to serve beings by means of this blessing.

source: །བདག་ཅག་བླ་ན་མེད་པའི་ཡེ་ཤེས་དེ་བསྒྲུབ་པར་ནུས་སོ།
en: We will be able to accomplish unsurpassed wisdom.

source: །བདག་ཅག་གིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱི་བའི་སླད་དུ། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་གཟུང་བར་བགྱི་ཞིང་བརྩོན་པ་དྲག་པོས་སྤྲོ་བར་བགྱིའོ།
en: We will joyfully uphold this mantra with great zeal in order to bring beings to maturity.

source: །ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བའི་སླད་དུ་ད་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱན་སྔར་རང་རང་གིས་དམ་བཅས་པ་ལ་གནས་པར་བགྱིའོ།
en: Additionally, out of compassion for beings, we will each live by our own pledges that we made before the thus-gone ones.

source: །ལྷའམ་ཀླུ་ནས་མིའི་བར་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པའི་དམ་པའི་ཆོས་ཀྱི་ཚུལ་འདི་མ་མཆིས་པར་བགྱིད་དམ། ཞིག་པར་བགྱིད་དམ། རྣམ་པར་མ་རུངས་པར་བགྱིད་ལ། བདག་ཅག་གིས་དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བགྱི་བའི་སླད་དུ། གལ་ཏེ་དེ་མ་བཟློག་གམ།
en: Should any god, nāga and so forth, or human being attempt to extinguish, destroy, or ruin this Dharma method which the thus-gone ones have blessed, then should we then fail to repel them or act assiduously against them so that the sacred Dharma may long remain, we will have deceived all the blessed buddhas who course through the three times. In that case, may we not fully awaken to unsurpassed and perfect buddhahood!

source: ནན་ཏན་མ་བགྱིས་ན་བདག་ཅག་གིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་བསླུས་པར་གྱུར་ཅིག །བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །ཀྱེ་གྲོགས་པོ་དག་ལྷ་ནས་མིའི་བར་གང་ལ་ལ་ཞིག །དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ལ་འཚེ་ལ། གལ་ཏེ་བདག་ཅག་གིས་དེ་དག་མ་བཟློག་གམ།
en: “Friends, should a god and so forth, or a human, harm a monk, nun, layman, or laywoman, if we do not repel them or exert ourselves to quell the disturbance they are creating, then we will have deceived all the blessed buddhas who course through the three times.

source: བདག་ཅག་གིས་དེ་དག་གི་འཁྲུག་པ་ཞི་བར་བགྱི་བའི་སླད་དུ་ནན་ཏན་མ་བགྱིས་ན།
en: In that case, may we not fully awaken to unsurpassed and perfect buddhahood!

source: བདག་ཅག་གིས་དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་བསླུས་པར་གྱུར་ཅིག །བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་ཞུགས་དང་། ཆབ་དང་། དུག་དང་། མཚོན་དང་། བྱད་དང་། རིམས་ཞག་གཅིག་པ་དང་། ཞག་གཉིས་པ་དང་། ཞག་གསུམ་པ་དང་། ཞག་བཞི་པས་འཇིགས་པ་ནས། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལུས་སྲུལ་པོ་དང་། རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། སེང་གེ་དང་། སྟག་དང་། ནད་དང་། བཀྲེས་པ་དང་། སྐོམ་པ་དང་། འཚེ་བ་གང་ཡང་རུང་བའི་བར་དག་གིས་འཇིགས་ཤིང་སྐྲག་པར་གྱུར་པ་ལས། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་དྲན་ན། སྔོན་གྱི་ལས་ཀྱི་སྒྲིབ་པ་ནི་མ་གཏོགས་ཏེ།
en: Blessed ones, should any noble son or daughter who seeks awakening be threatened by fire, water, poison, weapons, evil spirits, or infectious diseases that last one, two three, or four days or be threatened by or scared of any gods, nāgas, yakṣas, kaṭapūtanas, kṣatriyas, brahmins, vaiśyas, śūdras, lions, tigers, diseases, hunger, thirst, or harm of any kind, if they recall this dhāraṇī mantra, which fulfills all wishes and is blessed by all the buddhas, and we do not deliver them from such threats—except for those brought on by their own past karmic obscurations—then we will have deceived all the blessed buddhas who course through the three times.

source: བདག་ཅག་གིས་དེ་དག་གནོད་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་མ་བགྱིས་ན།
en: In that case, may we not fully awaken to unsurpassed and perfect buddhahood!”

source: དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་ཐམས་ཅད་བདག་ཅག་གིས་བསླུས་པར་གྱུར་ཅིག །བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །དེའི་ཚེ་གང་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་གཏོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: At that moment, all the blessed buddhas gathered in this buddha field expressed their approval, saying, “Good, O sublime beings.

source: སྐྱེས་བུ་དམ་པ་ཁྱེད་ཀྱིས་ལེགས་པར་དམ་བཅས་པ་ལེགས་སོ་ལེགས་སོ།
en: You have made an excellent promise.

source: །ཁྱེད་ཀྱིས་སྐྱེས་བུ་དམ་པའི་མཐུ་ཆེན་པོ་འདི་ལྟ་བུ་བྱེད་ནུས་སོ།
en: You will be able to enact this kind of great power that sublime beings possess.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་བདུད་སྡིག་ཏོ་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Śākyamuni then said to Māra , the evil one:

source: །ཐུབ་པ་གཤེགས་པ་འདི་དག་ལ་ནི་དད་ཅིང་དགའ་བའི་མཆོག་བསྐྱེད་དེ།
en: “Be joyful and faithful regarding these sages who have arrived.

source: །དེ་རིང་གཞན་གྱི་དོན་ཕྱིར་དགའ་བར་མྱུར་དུ་བྱང་ཆུབ་སེམས་གཞོལ་བྱོས།
en: Quickly, today, with joy, arouse the mind of awakening for the welfare of others.
